Repository: mduhme/mduhme.github.io
Catalog: generator/locale/*/LC_MESSAGES/messages.po
Languages: de

source: Based on
de: Basierend auf

source: Hi. I'm
de: Hi. Ich bin

source: description
de: Ich stehe derzeit vor dem Abschluss meines Masterstudiums in Computervisualistik an der Universität Koblenz, durch das ich Wissen in den Bereichen <strong>Bildverarbeitung & Computer Vision</strong>, <strong>Machine Learning</strong>, <strong>Robotik</strong> und <strong>Computergrafik</strong> erworben habe.<br>In Uni- und Hobbyprojekten sowie Praktika konnte ich Erfahrungen mit diversen Tools und Frameworks sammeln, darunter unter anderem <strong>Unreal Engine</strong>, <strong>ROS</strong> oder <strong>PyTorch</strong>. Insbesondere die Arbeit mit <strong>Python</strong> und <strong>modernem C++</strong> macht mir dabei Spaß.

source: Feel free to contact me
de: Gerne können Sie mich kontaktieren

source: My Resume
de: Lebenslauf

source: My Projects
de: Projekte

source: Resume
de: Lebenslauf

source: Projects
de: Projekte

source: Top
de: Nach oben

source: Here's some stuff I worked on.
de: Dinge, an denen ich gearbeitet habe.

source: Filter Keywords ...
de: Suche nach Begriffen ...

source: Keywords
de: Suchbegriffe

source: Master Thesis
de: Masterarbeit

source: Graph convolutional neural networks are applied in state-of-the-art models for skeleton-based action recognition. The focus of this work is to research the combination of this type of neural network and data from multiple modalities. Using skeletal data as a base for a graph convolutional network model, multiple approaches for fusion of skeleton, RGB and other sensor modalities are proposed. Experiments are conducted on the two multimodal datasets <a href="https://personal.utdallas.edu/~kehtar/UTD-MHAD.html" target="_blank">UTD-MHAD</a> and <a href="https://mmact19.github.io/2019/" target="_blank">MMAct</a> using various graph-like representations of modalities and their fusion at different stages of the neural network architecture.
de: Graph convolutional neural networks werden in modernen Verfahren skelettbasierter Aktionserkennung eingesetzt. Im Fokus der Arbeit steht die Untersuchung dieser Netzwerktypen im Zusammenhang mit dem Einsatz und der Fusion von Daten mehrerer Modalitäten. Unter Verwendung der graphstrukturierten Skelettdaten als Basis für ein graphenbasiertes, faltendes Netz werden unterschiedliche Verfahren vorgestellt, um Skelettsequenzen, RGB-Videosequenzen und Daten weiterer Sensoren zu vereinen. Die Versuche, die auf Daten aus den beiden multimodalen Datensätzen UTD-MHAD und MMAct basieren, betreffen Kombinationen der genannten Modalitäten, die an unterschiedlichen Stellen innerhalb der Netzwerkarchitektur stattfinden können.

source: The image shows one of the proposed fusion techniques concerning skeletal data (dark nodes), obtained from OpenPose, Kinect SDK, etc., and signals from accelerometer and gyroscope (red nodes) which are worn by the person performing an action. If both skeleton joints and IMU signals are represented by three-dimensional values (xyz), the skeleton graph can be augmented by simply appending additional nodes representing IMU (or other modalities).
de: Das Bild zeigt eines der vorgeschlagenen Fusionsverfahren von Skelettdaten (schwarze Knoten), erhalten durch OpenPose, Kinect SDK o.ä. und Signalen von getragenen Sensoren, wie z.B. Beschleunigungsmessern und Gyroskopen (rote Knoten). Falls beide Modalitäten durch dreidimensionale Werte repräsentiert sind, kann der Skelettgraph durch Anhängen weiterer Knoten (von IMU oder anderen Modalitäten) augmentiert werden.

source: Models are implemented and trained using PyTorch 1.6 with Python version 3.8 and CUDA 10.2. All computations and experiments are conducted on a single Nvidia RTX 2080 GPU with 8GB of video memory. To guarantee a deterministic and reproducible behavior, all training procedures are initialized with a fixed random seed.
de: Alle Modelle sind in PyTorch 1.6, Python version 3.8 und CUDA 10.2 implementiert worden. Für die Berechnungen und Experimente wurde eine Nvidia RTX 2080 verwendet. Um Reproduzierbarkeit zu garantieren, werden alle Trainingsdurchläufe mit einem festen Seed initialisiert.

source: Regarding the skeleton-based approach as the base model, experiments to investigate benefits of multimodal approaches show that multiple fusion methods of skeleton and inertial sensor data achieve better classification accuracies than the base model on UTD-MHAD while a slight decrease in performance is noticeable on MMAct. The approaches for fusion of skeleton and RGB, while experiencing high accuracies on several training runs, similarly show a slight decrease in performance over the base model in the majority of cases.
de: Unter der Betrachtung des rein skelettbasierten Ansatzes als Basismodell und Klassifizierungsgenauigkeit als Maß für die Effizienz eines Modells werden Experimente zur Feststellung von Vorteilen der vorgestellten multimodalen Ansätze gegenüber dem Basismodell durchgeführt. Durch Fusion von Skelett- und Inertialsensordaten kann gegenüber dem Basismodell auf UTD-MHAD ein verbessertes Ergebnis erzielt werden, auf MMAct sind jedoch leichte Rückgänge zu beobachten. Zwar erreichen die Fusionsverfahren von Skelett- und RGB-Daten in einigen Durchläufen positive Ergebnisse, so ist doch auch hier ein Abfall der Effizienz auszumachen.

source: During the research internship "Robbie" our team of nine students developed behavior and human-machine interactions for two service robots that are the size of a small human. I was primarily responsible for implementing a robust people following routine for the scenario of carrying groceries or luggage for a human subject. My specific team role was "Quality Management" which involved preparing, supervising and documenting test scenarios according to official tournament rules and ratings as well as introducing and verifying coding guidelines. The project was presented online as part of <a href="https://userpages.uni-koblenz.de/~cvtag/web/alle-demos/taxyeardemos/2020/">CV Tag 2020</a>.
de: Im Rahmen des Forschungspraktikums "Robbie" entwickelte unser Team aus neun Studierenden Verhalten und Mensch-Roboter-Interaktionen für zwei Serviceroboter. Meine Arbeit zeichnete sich hauptsächlich durch Implementierung einer robusten Routine zum Folgen von Personen aus, zum Beispiel wenn es darum geht, Gepäck oder Einkäufe zu tragen. In meiner Teamrolle "Qualitätsmanagement" war ich hauptsächlich verantwortlich für die Vorbereitung, Durchführung, Bewertung und Dokumentierung von Testdurchläufen auf Basis offizieller Turnierregeln, aber auch die Durchsetzung von Coding-Guidelines spielte eine Rolle. Das Projekt wurde als Teil des <a href="https://userpages.uni-koblenz.de/~cvtag/web/alle-demos/taxyeardemos/2020/">CV Tags 2020</a> präsentiert.

source: People tracking, which is required for following people, is a challenging subject. The task is to identify the same person within an arbitrary number of time-shifted image frames and to prevent a mismatch, that is, recognizing something/someone else as the target. Since this is a visual recognition task, re-identification is further complicated by occlusion (esp. by other people or taking abrupt turns through doors), lighting, video quality and clothes/appearance in combination with viewing a person from different angles. Furthermore, following requires the robot to drive behind the operator at a comfortable distance while avoiding obstacles which inevitably results in it losing its operator.
de: Tracking von Personen ist ein komplexes Thema und Voraussetzung, um Personen folgen zu können. Das Ziel ist es, eine Person zwischen einer beliebigen Anzahl zeitlich aufeinanderfolgenden Bilder wieder identifizieren zu können, ohne, dass Personen dabei vertauscht werden. Da es sich um ein visuelles Problem handelt, wird die Erkennung zusätzlich durch Verdeckung (durch andere Personen und Objekte), Lichtverhältnisse, Bildqualität und dem Aussehen der Personen beeinflusst. Außerdem muss der Roboter immer einen passenden Abstand zur zu folgenden Person halten, was zwangsweise dazu führt, dass die Kamera beim Ausweichen von Objekten gelegentlich ihr Ziel "aus den Augen" verliert.

source: Using ROS with C++, two packages <i>people-tracking</i> and <i>people-following</i> are created that communicate with each other. The former is responsible for tracking people between frames based on RGB-D images from Kinect, OpenPose detections and OpenCV. A feature vector is computed for each detection and matched with all existing tracks using Hungarian algorithm. Similarity metrics are euclidean distance of last known positions, euclidean distance of predicted positions using Unscented Kalman Filter, histogram comparison using Bhattacharyya distance, distance of face detection embeddings and an online classifier based on <a href="https://www.researchgate.net/publication/325854919_Convolutional_Channel_Features-Based_Person_Identification_for_Person_Following_Robots">this paper</a> (using features of a person reid neural network forwarded into online AdaBoost). The most reliable method is face detection which is not very useful to re-identify a followed person when the robot drives behind its target. <i>people-following</i> subscribes to the robot's base pose and camera pose and receives tracking data to publish commands that adjust the camera's position, turn the robot or drive to a location.
de: Zwei untereinander kommunizierende ROS-Pakete <i>people-tracking</i> und <i>people-following</i> werden mit C++ implementiert. Das erste Paket ist verantwortlich für das Tracking der Personen zwischen Bildern. Zur Verfügung stehen dabei RGB-D Bilder von Kinect, OpenPose-Detektionen, OpenCV und Eigen. Nachdem für jede Detektion ein Featurevektor und dessen Ähnlichkeit zu allen vorhandenen Tracks berechnet wurde, sorgt der Kuhn-Munkres-Algorithmus für die Zuordnung von Detektionen zu Tracks. Fünf Ähnlichkeitsmetriken werden eingesetzt: Euklidische Distanz zwischen zuletzt bekannten Positionen, euklidische Distanz zu prognostizierter Position durch ein Unscented Kalman-Filter, Histogrammvergleich mittels Bhattacharyya-Distanz, Distanz von Embeddings der Gesichtserkennung und ein Online-Klassifizierer basierend auf <a href="https://www.researchgate.net/publication/325854919_Convolutional_Channel_Features-Based_Person_Identification_for_Person_Following_Robots">diesem Paper</a>. Gesichtserkennung ist die verlässlichste Methode, jedoch beim Hinterherfahren selten einsetzbar. Das Paket <i>people-following</i> empfängt Nachrichten zu getrackten Personen und der aktuellen Pose der Roboterplattform und -kamera, auf deren Basis der Roboter bewegt wird

source: The above picture is produced by the <i>people-tracking</i> package for debugging/visualization purposes.
de: Das obere Bild wird durch <i>people-tracking</i> zu Visualisierungszwecken erzeugt.

source: Frame number since tracking started
de: Anzahl der Bilder seit Start des Trackings

source: Person bounding box (blue in tracking-only mode; In following mode: green for followed person, red for everyone else)
de: Bounding box einer Person (blau im Tracking-Modus; Im Folgen-Modus: grün bei gefolgter Person, sonst rot)

source: Face detection bounding box
de: Bounding box der Gesichtserkennung

source: Overall weighted matching error (lower is better)
de: Gewichteter Zuordnungsfehler (niedriger ist besser)

source: Unweighted matching errors of the mentioned similarity metrics (between 0-best and 1-worst)
de: Ungewichtete Fehler für die erwähnten Ähnlichkeitsmetriken (zwischen 0-gut und 1-schlecht)

source: Depth-masked person to omit background for histogram comparison
de: Tiefenmaske der Person um den Hintergrund beim Histogrammvergleich auszuschließen

source: Quality of current frame (green: good quality, usable for online learning; red: bad quality due to strong blur or occlusion, do not use to train online classifier)
de: Qualität der Erkennung (grün: gute Qualität, wird für Training des Online-Klassifizierers eingesetzt; rot: schlechte Qualität durch Unschärfe oder Verdeckung)

source: Person ID
de: ID einer Person

source: Here's a video showing people following in action with obstacles and partial occlusion
de: Hier ein Video, das <i>people-following</i> in Aktion zeigt

source: Edutainment: Fresco Restauration in VR
de: Edutainment: Restauration eines Freskengemäldes in VR

source: In this VR simulation you take the role of a painter who is tasked to restore a fresco ceiling painting inside a virtual reconstruction of Engers castle's Dianasaal. While playing, the game provides explanations and background to both fresco painting and the painting (named "Triumpf der Diana") itself. This project was created in a two-person team over nearly two semesters in Unreal Engine as part of the module Gamedesign/Edutainment. The project was presented as part of <a href="https://userpages.uni-koblenz.de/~cvtag/web/alle-demos/taxyeardemos/2019/">CV Tag 2019</a>.
de: In dieser VR-Simulation einer virtuellen Rekonstruktion des Dianasaals in Schloss Engers übernimmt man die Rolle eines Malers der beauftragt wird, ein Deckenfresko zu restaurieren. Während des Spiels werden Informationen zum Hintergrund des Gemäldes (namens "Triumpf der Diana") und der Maltechnik vermittelt. Das Projekt wurde im Zweierteam über ca. zwei Semester in Unreal Engine als Teil des Moduls "Gamedesign/Edutainment" fertiggestellt und als Teil des <a href="https://userpages.uni-koblenz.de/~cvtag/web/alle-demos/taxyeardemos/2019/">CV Tags 2019</a> präsentiert.

source: I was responsible to create most of the game's logic, especially the painting system. First, a masked "destruction" texture is applied onto the ceiling painting (see mask in left image below). Painting is accomplished by taking a "brush" texture and projecting it onto a drawable texture (render target) on the ceiling based on the user's input (click location with mouse or joystick direction in VR). The render target (see right image below) itself is then treated as a mask for the destruction texture.
de: Ich war verantwortlich für die Programmlogik, insbesondere der des Malsystems. Zuerst wird eine "Zerstörungs"-Textur auf das Deckengemälde angebracht (Maske dafür in Bild unten links). Um malen zu können, wird basierend auf der Eingabe des Nutzers (Klickbereich durch Maus oder Richtung des Joysticks in VR)eine Pinseltextur auf eine "bemalbare" Textur (Rendertarget) an der Decke projiziert. Das Rendertarget (Bild rechts unten) wird dann ebenfalls als Maske für die "Zerstörungs"-Textur verwendet.

source: painting-stages-desc
de: Die Rekonstruktion des Gemäldes ist in zwei Stufen unterteilt. Für ein Fresko ist es zunächst erforderlich, mehrere Schichten Kalkputz aufzutragen, der nach jeder Schicht trocknen muss. In diesem Spiel muss jedoch nur eine Schicht aufgetragen werden ohne nachträglicher Wartezeit &#128521;.<br> In der zweiten Stufe wird das Gemälde im Prinzip von Malen nach Zahlen nachgefärbt. Um zu verhindern, dass alles pixelgenau ausgefüllt werden muss, wird ein C++-Script eingesetzt um zu überprüfen, wann der Großteil einer Fläche ausgemalt wurde.

source: Here's a video showing painting the whole region and individual parts in debug mode, that is, using mouse & keyboard instead of VR joysticks <i class="icon solid fa-arrow-right" style="font-size: .7em"></i> janky movements &#x1F642;
de: Hier ist ein Video, das die zwei Stufen zeigt (mit Maus/Tastatur, daher die unsauberen Bewegungen &#x1F642;)

source: Realtime Terrain Rendering using Quadtree LOD
de: Terrain Rendering mit Quadtree LOD in Echtzeit

source: Terrain Rendering implemented using C++, OpenGL and tessellation shaders. A Quadtree deals with the LOD of the terrain and is updated whenever the camera moves. Each quadtree cell and its neighbor information is then passed to the tessellation shader where it is appropriately tessellated based on distance to camera.
de: Terrain Rendering auf Basis von C++, OpenGl und Tessellation-Shadern. Ein Quadtree sorgt für passendes LOD des Terrains und wird durch Bewegung der Kamera aktualisiert. Jede Zelle und dessen Nachbarschaftsinformationen wird dem Tessellation-Shader übergeben, der die Fläche abhängig von der Distanz zur Kamera passend aufteilt.

source: This way, using the neighbor information, vertex cracks in the environment between two small squares adjacent to one big square are easily avoided. The vertical displacement is then given by sampling a heightmap. While closing cracks is trivial, one big problem using Quadtrees for LOD is vertex popping when four small squares collapse into one big one and vice versa. Here's a video showing flying through the world with updating LOD:
de: Durch die Nachbarschaftsinformationen können Cracks zwischen zwei kleinen und einem großen Quadrat leicht vermieden werden. Die Vertikalität entsteht durch Sampling einer Heightmap. Obwohl das Schließen von Cracks trivial ist, führt die Verwendung von Quadtrees für LOD zu einem starken Effekt von Vertex-Popping, sobald sich vier kleine Flächen zu einer größeren Fläche zusammenschließen oder umgekehrt. Hier ist ein Video zum Projekt:

source: Research: Logic Puzzles - The Boy or Girl Paradox
de: Recherche: Logikrätsel - Junge-oder-Mädchen-Problem

source: The Boy or Girl paradox raises the question about the probability for a random two-child family to have two boys or two girls given some statement about the family or one of the two children. One of the most frequently used statements is about a random two-child family where at least one of the children is a boy and asked for is the probability of them having two boys. When intuitively answering these types of questions, people's opinions about the correct solution and method of achieving said solution differ. When dealing with conditional probabilities, people often apply simple mental models that either lead to a wrong solution or may be correct for a particular problem but don't transfer to other problems.
de: Beim Junge-oder-Mädchen-Problem geht es darum, basierend auf einer Aussage über eine Zweikindfamilie, die Wahrscheinlichkeit zu ermitteln, zu der beide Kinder Jungen oder beide Kinder Mädchen sind. Bei Beantwortung der Frage gehen die Meinungen auseinander. Im Vordergrund dabei steht das Problem, das Menschen haben, wenn sie mit bedingten Wahrscheinlichkeiten konfrontiert werden. Dabei wird meist ein simples mentales Modell des Problems angewandt, das jedoch nicht zu einer korrekten Lösung führt oder, falls doch, nicht auf andere Problemstellungen übertragbar ist.

source: Statements 1 and 2
de: Aussagen 1 und 2

source: Mr. Smith has two children. At least one of them is a boy. What is the probability P(BB) that both children are boys? Answer
de: Herr Schmitt hat zwei Kinder, davon mindestens einen Jungen. Wie hoch ist die Wahrscheinlichkeit P(BB), dass beide Kinder Jungen sind? Antwort

source: Mr. Jones has two children. The older child is a girl. What is the probability P(GG) that both children are girls? Answer
de: Herr Jones hat zwei Kinder. Das ältere Kind ist ein Mädchen. Wie hoch ist die Wahrscheinlichkeit P(GG), dass beide Kinder Mädchen sind? Antwort

source: The statement "at least one boy" implies that the latter of the four possibilities, girl-girl (see image), is unreachable. This leaves three equiprobable cases, one of which corresponds to the target scenario, i.e., the probability of having two boys. As for statement 2, two of the four cases are unreachable and so the resulting probability is 1/2. However, the first statement is ambiguous and, depending on context and background information, the answer could also be 1/2. The change in outcome is subject to the way in which the information "at least one of them is a boy" is obtained.
de: Die Aussage "mindestens ein" impliziert, dass die untere der vier Möglichkeiten (siehe Bild) nicht zutreffen kann. Es bleiben drei gleichwahrscheinliche Fälle, wovon einer der Zielbeschreibung entspricht. Für Aussage 2 ergeben nur zwei der vier Möglichkeiten Sinn, daher die resultierende Wahrscheinlichkeit von 1/2. Allerdings ist die erste Aussage mehrdeutig und kann, je nach Kontext und der Art, wie die Information erhalten wurde, auch zu einer Antwort von 1/2 führen.

source: Statements 3 and 4
de: Aussagen 3 und 4

source: Mr. Smith is the father of two. We meet him walking on the street with a young boy whom he proudly introduces as his son. What is the probability that Mr. Smith's other child is also a boy? Answer
de: Herr Schmitt ist der Vater von zwei Kindern. Wir treffen ihn während eines Spaziergangs mit einem Jungen, den er stolz als seinen Sohn vorstellt. Wie hoch ist die Wahrscheinlichkeit, dass Herrn Schmitts zweites Kind auch ein Junge ist? Antwort

source: We meet Mr. Smith (whom we know to be the father of two) in the street with a boy. This time, he is more elaborate in his introduction, presenting the boy as his eldest child. What is the probability that Mr. Smith's other child is also a boy? Answer
de: Wir treffen Herrn Schmitt (von dem wir wissen, dass er zwei Kinder hat) während eines Spaziergangs mit einem Jungen. Dieses Mal ist er mit seiner Aussage ausführlicher und stellt ihn als sein ältestes Kind vor. Wie hoch ist die Wahrscheinlichkeit, dass Herrn Schmitts zweites Kind auch ein Junge ist? Antwort

source: Contrary to what one intuitively believes when comparing statements 3 and 4 to statements 1 and 2, the solution to both statement 3 and statement 4 is identical, that is, P(BB) = 1/2. The relevant information is the observation that we meet the son on a walk with his father. Like the attributes <i>older</i> and <i>younger</i> child, this creates a notion of <i>child on a walk</i> and <i>child not on a walk</i>. The following figure shows all combinations and unreachable ones.
de: Konträr zu der Annahme, dass Aussagen 3 und 4 in ihrer Ähnlichkeit Aussagen 1 und 2 entsprechen, ist das Ergebnis für beide Aussagen eine Wahrscheinlichkeit von 1/2. Relevant ist die Information, dass ein Sohn in Person getroffen wird. Wie mit den Attributen <i>älter</i> und <i>jünger</i> bei Aussagen 1 und 2 führt dies hier zu einer Notation von <i>Kind getroffen</i> <i>Kind zuhause</i>, von denen alle möglichen und unerreichbaren Kombinationen in der folgenden Tabelle aufgelistet sind.

source: Research: BRDF Importance Sampling
de: Recherche: BRDF Importance Sampling

source: The <a href="https://en.wikipedia.org/wiki/Rendering_equation">rendering equation</a> can be approximated using Monte Carlo Integration (MCI) with N samples and a probability density function (PDF) that defines the distribution of incident light directions. Assuming the PDF corresponds to a uniform distribution, the incident light ray has equal probability to come from any direction. This results in a large variance for MCI and would be inefficient for strongly reflective surfaces.
de: Die <a href="https://de.wikipedia.org/wiki/Rendergleichung">Rendergleichung</a> kann mithilfe von Monte-Carlo-Integration (MCI) mit N Proben (Samples) und einer Wahrscheinlichkeitsdichtefunktion (PDF), welche die Verteilung von inzidenten Lichtrichtungen definiert, approximiert werden. Angenommen die PDF entspricht einer Gleichverteilung, dann ist die Wahrscheinlichkeit, zu der ein Lichtstahl aus einer bestimmten Richtung kommen kann, für alle Richtungen gleich. Dies führt zu einer starken Varianz für MCI und wäre für stark reflektierende Oberflächen ineffizient.
