Repository: mduhme/mduhme.github.io
Catalog: generator/locale/*/LC_MESSAGES/messages.po
Languages: de

source: Because convergence to a correct solution is <code>O(n<sup>-1/2</sup>)</code>, halving the approximation error requires four times the amount of samples. Importance Sampling is a technique to pick samples from distributions that reduce variance for MCI and, with that, reduce noise in the rendered image. The figure shows uniform sampling (left) and cosine-weighted sampling (right).
de: Weil MCI nur mit <code>O(n<sup>-1/2</sup>)</code> zu einem idealen Ergebnis konvergiert, werden für eine Halbierung des Fehlers viermal so viele Proben benötigt. Importance Sampling ist ein Verfahren, um gezielt Proben zu entnehmen, durch die die Varianz bei MCI möglichst gering bleibt, was dazu führt, dass Bildrauschen beim Rendering reduziert wird. Die Abbildung zeigt Sampling einer Gleichverteilung (links) und Sampling einer kosinusgewichteten Verteilung (rechts).

source: Japanese-English Offline Dictionary and Learning App (WIP)
de: Japanisch-Englisch Offline-Wörterbuch und Lernapp (WIP)

source: A Japanese-English offline dictionary and learning app built using C# WPF and the dictionaries JMdict end JMNedict. To achieve very quick response times, a Lucene search database is created from these dictionaries. Antlr is used to create a domain specific language for the search queries inside the app. The dictionary is still incomplete and the learning part (planned like Anki but more interactive) not started.
de: Entwicklung eines Offline-Wörterbuchs und einer Lernapp für Japanisch auf Basis von C# und WPF und den Datenbanken JMdict und JMNedict. Für schnelle Antwortzeiten sorgt ein Lucene-Suchindex und Antlr, um eine DSL für Suchanfragen umzusetzen. Die Funktionalität des Wörterbuchs ist unvollständig.

source: A collection of WPF GUI elements, mainly a tab panel with attachable, detachable and arbitrarily organizable tabs. Also included are UI elements like color and brush picker that are, for example, bound to and directly modify a WPF Color or SolidColorBrush object.
de: Eine Sammlung von GUI-Elementen für WPF, hauptsächlich ein Tab-Panel mit anfüg-, abtrenn- und gruppierbaren Tabs. Des Weiteren sind Elemente vorhanden, die an WPF-Klassen gebunden sind, so zum Beispiel ein Color- oder Brushpicker, um direkt Color und SolidColorBrush zu modifizieren.

source: Bachelor Thesis
de: Bachelorarbeit

source: For my bachelor thesis I developed a mini realtime graphics engine using only OpenGL and Java (JOGL). Since OpenGL is a state machine the goal was to create an efficient architecture and implement techniques to reduce the number of state changes. The architecture is based on the Entity–component–system architectural pattern, similar to Unity Engine.
de: Im Rahmen meiner Bachelorarbeit entwickelte ich eine kleine Echtzeit-Grafikengine mit OpenGL und Java (JOGL). Da OpenGL ein Zustandsautomat ist, war das Ziel, eine effiziente Architektur zu schaffen und Techniken zu implementieren, um die Anzahl der Zustandswechsel zu reduzieren. Die Architektur basiert auf dem Entity-component-system-Entwurfsmuster, das unter anderem auch bei der Unity Engine zum Einsatz kommt.

source: bachelor-thesis-desc-2
de: Ein naiver Ansatz für das Rendern von Objekten in OpenGL ist das Durchlaufen einer Liste, wodurch Zustand und Konfiguration für jedes Objekt geändert werden muss. Dies führt zu einer starken Ineffizienz, da mehr als 50% der verfügbaren Anwendungszeit zur Ausführung von OpenGL-Funktionen erforderlich wird und damit weniger Zeit für den Quellcode der Grafikengine übrig bleibt. In der Arbeit werden mehrere Techniken und ihre Auswirkung auf die Performance evaluiert. Dazu gehören Frustum Culling, räumliche Datenstrukturen, automatisches Batching von ähnlichen Objekten und anschließenden Multidraws, Sortieren von Objekten ung Dirty-Flags, um Neuberechnungen von unveränderten Werten zu vermeiden.

source: 3D Simulation and Manipulation of Signal Representations and their Fourier Transformation in VR
de: 3D-Simulation und Manipulation von Signalen und ihren Fourier-Transformierten in VR

source: In a two-person team we created a VR-simulation in Unity Engine that lets you modify images using a variety of different brushes and observe their changes influence the magnitude image of its Fourier transformation (or vice versa). I was mainly responsible for rendering and updating the images in realtime, implementing 2D-FFT as a C++ plugin for Unity and create the advisory screen using a HTML5 renderer for Unity.
de: In einem Zweierteam entwickelten wir eine VR-Simulation in Unity die ermöglicht, Bilder unter Auswahl einer von zahlreichen Pinseln zu modifizieren und sofort die Auswirkungen auf das Magnitudenspektrum der Fourier-Transformierten zu beobachten (oder umgekehrt). Ich war hauptsächlich dafür verantwortlich, alle Bilder in Echtzeit zu aktualisieren, ein C++-Plugin zur Berechnung der 2D-FFT zu implementieren und den Hilfsbildschirm mithilfe eines HTML5-Renderers für Unity zu entwerfen.

source: The image (grayscale only) itself is rendered as a 3D-representation with the pixel intensity being the vertical displacement. For performance reasons, the 3D image is not made up of individual cuboid entities but instead a single mesh that is generated on the fly. The user selects a brush (e.g., 5x5 brush illustrated by green area in image) and applies it by pointing on the image (ray gets projected onto mesh to determine area of input) and then dragging up or down to modify the intensity of the pixel area.
de: Das Bild (nur Grauwertbild) wird als 3D-Repräsentation gerendert, wobei die Pixelintensitäten für die vertikale Verschiebung sorgen. Aus Performancegründen wird das 3D-Bild nicht aus individuellen Quadern zusammengesetzt, sondern als ein komplettes Mesh gerendert, das für jede Aktualisierung neu erzeugt wird. Der Nutzer wählt einen Pinsel (zum Beispiel ein 5x5 Quadrat wie durch den grünen Bereich im Bild verdeutlicht) und wendet ihn durch Zeigen auf das Bild an. Dabei wird ein Strahl auf das Mesh projiziert, um den Eingabeschnittpunkt zu ermitteln. Durch vertikale Bewegungen des Joysticks kann dann durch den Pinsel die Intensität des Pixelbereichs angepasst werden.

source: Puzzle Box in OpenGL
de: Puzzle in OpenGL

source: My first project using OpenGL (with perspective camera, lighting and animations) in Java (LWJGL) was about creating a puzzle game where you could use any of your own pictures to puzzle. Additionally, the user can choose from a variety of different filters that are applied to the image, such as painting filter (using binning/thresholding in HSV color space) or drawing filter (using sobel edges).
de: Mein erstes Projekt mit OpenGL (mit perspektivischer Kamera, Beleuchtung und Animationen) in Java (LWJGL) umfasste die Entwicklung eines Puzzlespiels, für das eigene Fotos genutzt werden können. Zusätzlich kann der Nutzer einen von vielen verfügbaren Filtern auswählen, der auf das Bild angewandt wird. Dazu zählen beispielsweise ein Gemälde-Filter (durch Thresholding im HSV-Farbraum) oder Zeichnungs-Filter (durch Sobel-Kantendetektion).

source: The user is able to drag and drop the individual puzzle parts. Correctness of a placed part is communicated with an appropriate sound. Here's an image showing the painting filter:
de: Dem Nutzer ist es möglich, individuelle Puzzleteile per Drag&Drop zu bewegen und zu platzieren. Ob ein Puzzleteil richtig oder falsch platziert wurde, wird mit einem entsprechendem Ton bekannt gegeben.

source: In this web design group project we created a social network where users can start challenges to upload pictures of a specific theme (e.g., nature, food) and type (e.g., photography, drawing, screenshot). Users can either join the challenge or comment and vote on their favorite picture. I was mainly responsible for backend programming and front end pages for user registration, login and profile. Sample image from <a href="https://www.publicdomainpictures.net">https://www.publicdomainpictures.net</a>.
de: In diesem Gruppenprojekt für Webentwicklung haben wir ein soziales Netzwerk entwickelt, in dem Nutzer Challenges starten können, indem sie ein Bild von einem bestimmten Typ (Screenshot, Fotografie, Zeichnung) und eines bestimmten Themas (Natur, Essen) hochladen. Andere Nutzer können entweder ihr favorisiertes Bild kommentieren und bewerten oder selbst durch Upload eines passenden Bilds in die Challenge einsteigen. Ich war hauptsächlich verantwortlich für Programmierung des Backends in PHP und Programmierung des Frontends für die Seiten des Benutzerprofils und der Benutzerregistrierung und -anmeldung. Beispielbild von <a href="https://www.publicdomainpictures.net">https://www.publicdomainpictures.net</a>.

source: Some Older & Small-scale Projects
de: Alte & Kleine Projekte

source: Some smaller and first programming projects that were part of my undergraduate curriculum.
de: Einige kleinere Projekte, die Teil meines Bachelorstudiums waren.

source: Modelling and Rendering of a Festival / Circus World in Autodesk Maya 2016
de: Modellierung und Rendering einer Kirmes / Zirkuswelt in Autodesk Maya 2016

source: Photo Viewer with Social Media and Cloud Synchronization built in JavaFX
de: Foto-App mit Synchronisierung für soziale Netzwerke und Clouds in JavaFX

source: Synchronization only implemented for Flickr since it provided the least restricted API without paid access.
de: Die Synchronisierung wurde nur mit Flickr implementiert, da die API ohne bezahlten Zugang am wenigsten eingeschränkt war.

source: Re-creation of a World Heritage Site using Shapes in Adobe Illustrator
de: Nachempfindung eines Weltkultureres in Adobe Illustrator

source: Building: Alatornio Church<br> Lots of trees in the background are missing &#x1F642;
de: Gebäude: Kirche von Alatornio<br>Die Bäume und Sträucher im Vorder- und Hintergrund habe ich ausgelassen &#x1F642;

source: My first group programming project ever is a whack-a-mole game built in Java Swing. It doesn't look pretty but it works &#128521;
de: Mein erstes Gruppen-Programmierprojekt "MoleSmash" ist Whack-a-mole implementiert in Java Swing. Sieht nicht sonderlich hübsch aus, funktioniert aber &#128521;

source: Get in touch with me
de: Kontaktieren Sie mich

source: The places I worked and studied at.
de: Hier habe ich gelernt und gearbeitet.

source: Education
de: Ausbildung

source: Computational Visualistics
de: Computervisualistik

source: University of Koblenz
de: Universität Koblenz

source: Image Processing
de: Bildverarbeitung

source: Robotics
de: Robotik

source: Computer Graphics
de: Computergrafik

source: Operating Systems
de: Betriebssysteme

source: Programming languages
de: Programmiersprachen

source: Computational Visualistics and Design
de: Computervisualistik und Design

source: Oct. 2013 - Oct. 2017
de: Okt. 2013 - Okt. 2017

source: Hamm-Lippstadt University of Applied Sciences
de: Hochschule Hamm-Lippstadt

source: Foundations of Computer science (algorithms, data structures, software design patterns), computer vision and computer graphics
de: Grundlagen der Informatik (Algorithmen, Datenstrukturen, Entwurfsmuster der Softwarearchitektur), Bildverarbeitung und Computergrafik

source: ergonomics
de: Ergonomie

source: web design
de: Webentwicklung

source: Main programming language
de: Meistgenutzte Programmiersprache

source: Internships
de: Praktika

source: Work on two much-rewarded service robots as part of a research internship in a team of nine students and two research assistants.
de: Als Teil eines Forschungspraktikums ging es in einem Team von neun Studierenden und zwei wiss. Mitarbeitern um die Arbeit an zwei Servicerobotern, die bereits mehrere Auszeichnungen erhalten haben.

source: Implementation of human-robot-interactions in the context of home assistance, such as people tracking & following and item retrieval, carrying and handover, in preparation for RoboCup German Open and RoboCup World Championship (sadly both cancelled due to the pandemic)
de: Implementierung von Mensch-Roboter-Interaktionen im Bereich der Heimassistenz, beispielsweise das Tracken & Folgen von Personen oder Beschaffen, Tragen und Übergabe von Gegenständen. In Vorbereitung auf den RoboCup German Open und Robocup World Championship wurden Wettkampfszenarien nachgestellt (beide Wettkämpfe leider aufgrund der Pandemie abgesagt)

source: Special team role: Quality Management
de: Teamfunktion: Qualitätsmanagement

source: Verification of compliance of coding standards and style guides
de: Verifizierung der Einhaltung von Coding-Standards und Style-Guides

source: Writing of documentations
de: Schreiben von Dokumentationen

source: Conduction and supervision of tests according to official tournament rules and ratings
de: Durchführung und Beaufsichtigung von Tests basierend auf offiziellen Turnierregeln und Bewertungstabellen

source: Development of a mockup / prototype for a driver assistance / recommendation system
de: Entwicklung eines Prototypen für ein Fahrerassistenzsystem / Empfehlungssystem

source: Work with C++ and Bash-Shell on Ubuntu, compilation for target infotainment system hardware
de: Arbeit mit C++ und Bash unter Ubuntu, Kompilierung und Ausführung direkt auf Zielhardware / Infotainmentsystem

source: Git, Jira for version control, project management
de: Git, Jira für Versionskontrolle, Projektmanagement

source: Close coordination with team in India
de: Enge Zusammenarbeit mit Team in Indien

source: Setup and assistance at exhibitions
de: Aufbau und Assistenz auf Ausstellungen

source: Daily stand-up meetings in small team to discuss progress
de: Tägliche Stand-up-meetings in kleinem Team, um Fortschritt zu besprechen

source: Skills
de: Kenntnisse

source: Most used programming languages / technologies
de: Meistgenutzte Programmiersprachen und Technologien

source: incl. and preferably modern C++ 17 and 20
de: inkl. und vorzugsweise modernes C++ 17 und 20

source: Spoken languages
de: Gesprochene Sprachen

source: German (native)
de: Deutsch (Muttersprache)

source: English (fluent)<br>Written english master thesis + seminar work / presentations + Bosch internship
de: Englisch (fließend)<br>Englische Masterarbeit + Seminararbeiten und -präsentationen + Bosch Praktikum

source: Japanese as a hobby (so far only basic/interm. reading)
de: Japanisch als Hobby (bisher nur einfache/intermediäre Lesekenntnisse)

source: See some of my recent work
de: Zu meinen aktuellen Projekten
